###############################################################################
#
# Created by PrimeTime on Thu Oct  7 17:38:15 2021
#
###############################################################################
# 
# Written by HyperScale Constraint Extractor
# Version : R-2020.09-SP5
# Top design name : cmsdk_mcu
# Block name : MemContext1
# Extraction Mode : normal
# Instance : u_mem_context1
# 
###############################################################################
set_units -time ns -capacitance pF -current mA -voltage V -resistance kOhm -power pW
###############################################################################
#  
# Units
# capacitive_load_unit           : 1 pF
# current_unit                   : 0.001 A
# resistance_unit                : 1 kOhm
# time_unit                      : 1 ns
# voltage_unit                   : 1 V
###############################################################################
set_operating_conditions -analysis_type on_chip_variation  -library [get_libs {scadv10_cln65gp_rvt_tt_1p0v_25c.db:scadv10_cln65gp_rvt_tt_1p0v_25c}] 
create_clock -name XTAL1 -period 2.5 -waveform { 0 1.25 } -add [get_ports {gated_hclk}]
###############################################################################
#
# Created by pt_shell on Thu Oct  7 17:38:15 2021
#
###############################################################################
# 
# Written by HyperScale Constraint Extractor
# Version : R-2020.09-SP5
# Top design name : cmsdk_mcu
# Block name : MemContext1
# Extraction Mode : normal
# Instance : u_mem_context1
# 
###############################################################################
set_clock_map XTAL1 -parent_clock XTAL1
###############################################################################
# Boundary Context Information
###############################################################################
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[7]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[6]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[5]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[4]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[3]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[2]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[1]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[0]}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_chip_select}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_chip_select}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_n3}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_n3}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_SRAMWDATA[23]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_SRAMWDATA[23]}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_SRAMWDATA[22]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_SRAMWDATA[22]}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_SRAMWDATA[21]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_SRAMWDATA[21]}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_SRAMWDATA[20]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_SRAMWDATA[20]}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_SRAMWDATA[19]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_SRAMWDATA[19]}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_SRAMWDATA[18]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_SRAMWDATA[18]}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_SRAMWDATA[17]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_SRAMWDATA[17]}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_SRAMWDATA[16]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_SRAMWDATA[16]}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_SRAMADDR[11]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_SRAMADDR[11]}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_SRAMADDR[10]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_SRAMADDR[10]}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_SRAMADDR[9]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_SRAMADDR[9]}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_SRAMADDR[8]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_SRAMADDR[8]}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_SRAMADDR[7]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_SRAMADDR[7]}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_SRAMADDR[6]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_SRAMADDR[6]}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_SRAMADDR[5]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_SRAMADDR[5]}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_SRAMADDR[4]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_SRAMADDR[4]}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_SRAMADDR[3]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_SRAMADDR[3]}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_SRAMADDR[2]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_SRAMADDR[2]}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_SRAMADDR[1]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_SRAMADDR[1]}]
set_max_capacitance  2.443564 [get_ports {u_ahb_ram_genblk3_SRAMADDR[0]}]
set_max_transition  0.699428 [get_ports {u_ahb_ram_genblk3_SRAMADDR[0]}]
set_max_capacitance  0.916337 [get_ports {gated_hclk}]
set_max_transition  0.699428 [get_ports {gated_hclk}]
set_output_delay  0.502513 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[7]}]
set_output_delay  0.101508 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[7]}]
set_output_delay  0.49318 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[7]}]
set_output_delay  0.09901 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[7]}]
set_load -pin_load -max  0.003697 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[7]}]
set_load -pin_load -max  0.003697 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[7]}]
set_load -pin_load -min  0.003697 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[7]}]
set_load -pin_load -min  0.003697 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[7]}]
set_output_delay  0.491672 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[6]}]
set_output_delay  0.09059 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[6]}]
set_output_delay  0.462323 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[6]}]
set_output_delay  0.083452 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[6]}]
set_load -pin_load -max  0.001087 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[6]}]
set_load -pin_load -max  0.001087 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[6]}]
set_load -pin_load -min  0.001087 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[6]}]
set_load -pin_load -min  0.001087 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[6]}]
set_output_delay  0.494741 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[5]}]
set_output_delay  0.084062 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[5]}]
set_output_delay  0.478456 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[5]}]
set_output_delay  0.077967 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[5]}]
set_load -pin_load -max  0.001087 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[5]}]
set_load -pin_load -max  0.001087 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[5]}]
set_load -pin_load -min  0.001087 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[5]}]
set_load -pin_load -min  0.001087 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[5]}]
set_output_delay  0.494259 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[4]}]
set_output_delay  0.081258 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[4]}]
set_output_delay  0.481496 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[4]}]
set_output_delay  0.082811 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[4]}]
set_load -pin_load -max  0.001733 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[4]}]
set_load -pin_load -max  0.001733 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[4]}]
set_load -pin_load -min  0.001733 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[4]}]
set_load -pin_load -min  0.001733 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[4]}]
set_output_delay  0.493674 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[3]}]
set_output_delay  0.066831 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[3]}]
set_output_delay  0.472391 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[3]}]
set_output_delay  0.063467 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[3]}]
set_load -pin_load -max  0.001733 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[3]}]
set_load -pin_load -max  0.001733 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[3]}]
set_load -pin_load -min  0.001733 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[3]}]
set_load -pin_load -min  0.001733 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[3]}]
set_output_delay  0.527906 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[2]}]
set_output_delay  0.103408 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[2]}]
set_output_delay  0.495386 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[2]}]
set_output_delay  0.097923 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[2]}]
set_load -pin_load -max  0.001915 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[2]}]
set_load -pin_load -max  0.001915 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[2]}]
set_load -pin_load -min  0.001915 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[2]}]
set_load -pin_load -min  0.001915 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[2]}]
set_output_delay  0.495028 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[1]}]
set_output_delay  0.108025 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[1]}]
set_output_delay  0.472765 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[1]}]
set_output_delay  0.107511 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[1]}]
set_load -pin_load -max  0.001087 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[1]}]
set_load -pin_load -max  0.001087 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[1]}]
set_load -pin_load -min  0.001087 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[1]}]
set_load -pin_load -min  0.001087 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[1]}]
set_output_delay  0.494722 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[0]}]
set_output_delay  0.068112 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[0]}]
set_output_delay  0.468827 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[0]}]
set_output_delay  0.063233 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[0]}]
set_load -pin_load -max  0.001733 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[0]}]
set_load -pin_load -max  0.001733 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[0]}]
set_load -pin_load -min  0.001733 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[0]}]
set_load -pin_load -min  0.001733 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_data_out[0]}]
set_input_delay  1.149034 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_chip_select}]
set_input_delay  0.809407 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_chip_select}]
set_input_delay  1.163749 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_chip_select}]
set_input_delay  0.782775 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_chip_select}]
set_input_delay  2.516412 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_chip_select}]
set_input_delay  0.68425 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_chip_select}]
set_input_delay  2.54811 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_chip_select}]
set_input_delay  0.653599 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_chip_select}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.144622  -input_transition_fall 0.078622  [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_chip_select}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.144622  -input_transition_fall 0.078622  [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_chip_select}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.144622  -input_transition_fall 0.078622  [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_chip_select}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.144622  -input_transition_fall 0.078622  [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_chip_select}]
set_case_analysis 1 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2__Logic1_}]
set_case_analysis 0 [get_ports {u_ahb_ram_genblk3_u_fpga_sram_sBRAM2__Logic0_}]
set_input_delay  1.123901 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_n3}]
set_input_delay  1.045748 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_n3}]
set_input_delay  1.152021 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_n3}]
set_input_delay  1.03758 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_n3}]
set_input_delay  2.474883 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_n3}]
set_input_delay  0.616238 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_n3}]
set_input_delay  2.536381 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_n3}]
set_input_delay  0.607162 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_u_fpga_sram_n3}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.165681  -input_transition_fall 0.114638  [get_ports {u_ahb_ram_genblk3_u_fpga_sram_n3}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.165681  -input_transition_fall 0.114638  [get_ports {u_ahb_ram_genblk3_u_fpga_sram_n3}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.165657  -input_transition_fall 0.113495  [get_ports {u_ahb_ram_genblk3_u_fpga_sram_n3}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.165657  -input_transition_fall 0.113495  [get_ports {u_ahb_ram_genblk3_u_fpga_sram_n3}]
set_input_delay  0.771128 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[23]}]
set_input_delay  0.731832 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[23]}]
set_input_delay  0.795712 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[23]}]
set_input_delay  0.777309 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[23]}]
set_input_delay  1.525169 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[23]}]
set_input_delay  0.512419 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[23]}]
set_input_delay  1.592825 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[23]}]
set_input_delay  0.478995 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[23]}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.145169  -input_transition_fall 0.078895  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[23]}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.145169  -input_transition_fall 0.078895  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[23]}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.145169  -input_transition_fall 0.078895  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[23]}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.145169  -input_transition_fall 0.078895  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[23]}]
set_input_delay  0.746855 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[22]}]
set_input_delay  0.708194 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[22]}]
set_input_delay  0.783664 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[22]}]
set_input_delay  0.762958 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[22]}]
set_input_delay  1.533799 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[22]}]
set_input_delay  0.507033 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[22]}]
set_input_delay  1.621884 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[22]}]
set_input_delay  0.487846 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[22]}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.145455  -input_transition_fall 0.079044  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[22]}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.145455  -input_transition_fall 0.079044  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[22]}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.145455  -input_transition_fall 0.079044  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[22]}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.145455  -input_transition_fall 0.079044  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[22]}]
set_input_delay  0.668951 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[21]}]
set_input_delay  0.635786 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[21]}]
set_input_delay  0.71211 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[21]}]
set_input_delay  0.690285 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[21]}]
set_input_delay  1.438981 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[21]}]
set_input_delay  0.472738 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[21]}]
set_input_delay  1.535026 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[21]}]
set_input_delay  0.453408 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[21]}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16MA10TR -from_pin A -pin Y -input_transition_rise 0.16658  -input_transition_fall 0.09045  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[21]}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16MA10TR -from_pin A -pin Y -input_transition_rise 0.16658  -input_transition_fall 0.09045  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[21]}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16MA10TR -from_pin A -pin Y -input_transition_rise 0.166575  -input_transition_fall 0.090437  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[21]}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16MA10TR -from_pin A -pin Y -input_transition_rise 0.166575  -input_transition_fall 0.090437  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[21]}]
set_input_delay  0.755264 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[20]}]
set_input_delay  0.719649 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[20]}]
set_input_delay  0.791151 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[20]}]
set_input_delay  0.767055 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[20]}]
set_input_delay  1.530403 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[20]}]
set_input_delay  0.514117 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[20]}]
set_input_delay  1.614189 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[20]}]
set_input_delay  0.479088 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[20]}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.147431  -input_transition_fall 0.080112  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[20]}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.147431  -input_transition_fall 0.080112  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[20]}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.147431  -input_transition_fall 0.080112  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[20]}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.147431  -input_transition_fall 0.080112  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[20]}]
set_input_delay  0.740802 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[19]}]
set_input_delay  0.707245 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[19]}]
set_input_delay  0.803857 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[19]}]
set_input_delay  0.779766 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[19]}]
set_input_delay  1.512515 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[19]}]
set_input_delay  0.504028 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[19]}]
set_input_delay  1.62474 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[19]}]
set_input_delay  0.48419 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[19]}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.134136  -input_transition_fall 0.072977  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[19]}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.134136  -input_transition_fall 0.072977  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[19]}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.134136  -input_transition_fall 0.072977  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[19]}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.134136  -input_transition_fall 0.072977  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[19]}]
set_input_delay  0.721965 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[18]}]
set_input_delay  0.687483 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[18]}]
set_input_delay  0.790669 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[18]}]
set_input_delay  0.768138 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[18]}]
set_input_delay  1.497769 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[18]}]
set_input_delay  0.456705 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[18]}]
set_input_delay  1.617411 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[18]}]
set_input_delay  0.433447 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[18]}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.136659  -input_transition_fall 0.074302  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[18]}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.136659  -input_transition_fall 0.074302  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[18]}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.136656  -input_transition_fall 0.074295  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[18]}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.136656  -input_transition_fall 0.074295  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[18]}]
set_input_delay  0.760673 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[17]}]
set_input_delay  0.725935 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[17]}]
set_input_delay  0.825727 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[17]}]
set_input_delay  0.803888 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[17]}]
set_input_delay  1.51729 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[17]}]
set_input_delay  0.47343 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[17]}]
set_input_delay  1.6275 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[17]}]
set_input_delay  0.44512 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[17]}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.137605  -input_transition_fall 0.074825  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[17]}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.137605  -input_transition_fall 0.074825  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[17]}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.137605  -input_transition_fall 0.074825  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[17]}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.137605  -input_transition_fall 0.074825  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[17]}]
set_input_delay  0.787323 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[16]}]
set_input_delay  0.750317 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[16]}]
set_input_delay  0.85919 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[16]}]
set_input_delay  0.835924 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[16]}]
set_input_delay  1.551201 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[16]}]
set_input_delay  0.47896 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[16]}]
set_input_delay  1.662995 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[16]}]
set_input_delay  0.449326 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMWDATA[16]}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.136151  -input_transition_fall 0.074049  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[16]}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.136151  -input_transition_fall 0.074049  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[16]}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.13615  -input_transition_fall 0.074049  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[16]}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.13615  -input_transition_fall 0.074049  [get_ports {u_ahb_ram_genblk3_SRAMWDATA[16]}]
set_input_delay  1.074404 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[11]}]
set_input_delay  1.003697 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[11]}]
set_input_delay  1.079655 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[11]}]
set_input_delay  1.003756 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[11]}]
set_input_delay  2.458765 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[11]}]
set_input_delay  0.647172 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[11]}]
set_input_delay  2.464016 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[11]}]
set_input_delay  0.647607 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[11]}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.151309  -input_transition_fall 0.082212  [get_ports {u_ahb_ram_genblk3_SRAMADDR[11]}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.151309  -input_transition_fall 0.082212  [get_ports {u_ahb_ram_genblk3_SRAMADDR[11]}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.151311  -input_transition_fall 0.082212  [get_ports {u_ahb_ram_genblk3_SRAMADDR[11]}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.151311  -input_transition_fall 0.082212  [get_ports {u_ahb_ram_genblk3_SRAMADDR[11]}]
set_input_delay  1.053067 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[10]}]
set_input_delay  0.985504 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[10]}]
set_input_delay  1.05921 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[10]}]
set_input_delay  0.986798 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[10]}]
set_input_delay  2.437428 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[10]}]
set_input_delay  0.631244 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[10]}]
set_input_delay  2.443571 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[10]}]
set_input_delay  0.633067 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[10]}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.149749  -input_transition_fall 0.082213  [get_ports {u_ahb_ram_genblk3_SRAMADDR[10]}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.149749  -input_transition_fall 0.082213  [get_ports {u_ahb_ram_genblk3_SRAMADDR[10]}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.149751  -input_transition_fall 0.082196  [get_ports {u_ahb_ram_genblk3_SRAMADDR[10]}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.149751  -input_transition_fall 0.082196  [get_ports {u_ahb_ram_genblk3_SRAMADDR[10]}]
set_input_delay  0.955678 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[9]}]
set_input_delay  0.885218 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[9]}]
set_input_delay  1.009682 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[9]}]
set_input_delay  0.932954 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[9]}]
set_input_delay  2.340039 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[9]}]
set_input_delay  0.532978 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[9]}]
set_input_delay  2.394043 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[9]}]
set_input_delay  0.581226 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[9]}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.094008  -input_transition_fall 0.114926  [get_ports {u_ahb_ram_genblk3_SRAMADDR[9]}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.094008  -input_transition_fall 0.114926  [get_ports {u_ahb_ram_genblk3_SRAMADDR[9]}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.085126  -input_transition_fall 0.110788  [get_ports {u_ahb_ram_genblk3_SRAMADDR[9]}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.085126  -input_transition_fall 0.110788  [get_ports {u_ahb_ram_genblk3_SRAMADDR[9]}]
set_input_delay  1.05192 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[8]}]
set_input_delay  1.004526 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[8]}]
set_input_delay  1.080231 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[8]}]
set_input_delay  1.028448 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[8]}]
set_input_delay  2.436281 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[8]}]
set_input_delay  0.658403 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[8]}]
set_input_delay  2.464592 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[8]}]
set_input_delay  0.674878 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[8]}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.143235  -input_transition_fall 0.077871  [get_ports {u_ahb_ram_genblk3_SRAMADDR[8]}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.143235  -input_transition_fall 0.077871  [get_ports {u_ahb_ram_genblk3_SRAMADDR[8]}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.143235  -input_transition_fall 0.077871  [get_ports {u_ahb_ram_genblk3_SRAMADDR[8]}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.143235  -input_transition_fall 0.077871  [get_ports {u_ahb_ram_genblk3_SRAMADDR[8]}]
set_input_delay  0.954731 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[7]}]
set_input_delay  0.907657 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[7]}]
set_input_delay  1.015232 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[7]}]
set_input_delay  0.964573 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[7]}]
set_input_delay  2.339092 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[7]}]
set_input_delay  0.536717 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[7]}]
set_input_delay  2.399593 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[7]}]
set_input_delay  0.590387 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[7]}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.084925  -input_transition_fall 0.089439  [get_ports {u_ahb_ram_genblk3_SRAMADDR[7]}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.084925  -input_transition_fall 0.089439  [get_ports {u_ahb_ram_genblk3_SRAMADDR[7]}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.084923  -input_transition_fall 0.089435  [get_ports {u_ahb_ram_genblk3_SRAMADDR[7]}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.084923  -input_transition_fall 0.089435  [get_ports {u_ahb_ram_genblk3_SRAMADDR[7]}]
set_input_delay  1.093648 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[6]}]
set_input_delay  1.021098 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[6]}]
set_input_delay  1.097625 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[6]}]
set_input_delay  1.021891 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[6]}]
set_input_delay  2.478009 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[6]}]
set_input_delay  0.666214 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[6]}]
set_input_delay  2.481987 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[6]}]
set_input_delay  0.667516 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[6]}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.149497  -input_transition_fall 0.081487  [get_ports {u_ahb_ram_genblk3_SRAMADDR[6]}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.149497  -input_transition_fall 0.081487  [get_ports {u_ahb_ram_genblk3_SRAMADDR[6]}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.149499  -input_transition_fall 0.081434  [get_ports {u_ahb_ram_genblk3_SRAMADDR[6]}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.149499  -input_transition_fall 0.081434  [get_ports {u_ahb_ram_genblk3_SRAMADDR[6]}]
set_input_delay  1.077025 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[5]}]
set_input_delay  1.029763 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[5]}]
set_input_delay  1.111361 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[5]}]
set_input_delay  1.058288 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[5]}]
set_input_delay  2.461386 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[5]}]
set_input_delay  0.685631 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[5]}]
set_input_delay  2.495723 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[5]}]
set_input_delay  0.70797 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[5]}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.158706  -input_transition_fall 0.086292  [get_ports {u_ahb_ram_genblk3_SRAMADDR[5]}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.158706  -input_transition_fall 0.086292  [get_ports {u_ahb_ram_genblk3_SRAMADDR[5]}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.158706  -input_transition_fall 0.086292  [get_ports {u_ahb_ram_genblk3_SRAMADDR[5]}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.158706  -input_transition_fall 0.086292  [get_ports {u_ahb_ram_genblk3_SRAMADDR[5]}]
set_input_delay  0.947955 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[4]}]
set_input_delay  0.900988 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[4]}]
set_input_delay  1.014085 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[4]}]
set_input_delay  0.960291 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[4]}]
set_input_delay  2.332316 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[4]}]
set_input_delay  0.561526 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[4]}]
set_input_delay  2.398446 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[4]}]
set_input_delay  0.613001 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[4]}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.087577  -input_transition_fall 0.092188  [get_ports {u_ahb_ram_genblk3_SRAMADDR[4]}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.087577  -input_transition_fall 0.092188  [get_ports {u_ahb_ram_genblk3_SRAMADDR[4]}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.087575  -input_transition_fall 0.092184  [get_ports {u_ahb_ram_genblk3_SRAMADDR[4]}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.087575  -input_transition_fall 0.092184  [get_ports {u_ahb_ram_genblk3_SRAMADDR[4]}]
set_input_delay  0.96596 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[3]}]
set_input_delay  0.916634 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[3]}]
set_input_delay  1.015291 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[3]}]
set_input_delay  0.966492 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[3]}]
set_input_delay  2.350321 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[3]}]
set_input_delay  0.558636 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[3]}]
set_input_delay  2.399652 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[3]}]
set_input_delay  0.610087 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[3]}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.081023  -input_transition_fall 0.082836  [get_ports {u_ahb_ram_genblk3_SRAMADDR[3]}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.081023  -input_transition_fall 0.082836  [get_ports {u_ahb_ram_genblk3_SRAMADDR[3]}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.080993  -input_transition_fall 0.082826  [get_ports {u_ahb_ram_genblk3_SRAMADDR[3]}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.080993  -input_transition_fall 0.082826  [get_ports {u_ahb_ram_genblk3_SRAMADDR[3]}]
set_input_delay  0.940453 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[2]}]
set_input_delay  0.891129 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[2]}]
set_input_delay  1.004878 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[2]}]
set_input_delay  0.948888 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[2]}]
set_input_delay  2.362267 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[2]}]
set_input_delay  0.553672 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[2]}]
set_input_delay  2.389239 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[2]}]
set_input_delay  0.601683 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[2]}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.090041  -input_transition_fall 0.094213  [get_ports {u_ahb_ram_genblk3_SRAMADDR[2]}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.090041  -input_transition_fall 0.094213  [get_ports {u_ahb_ram_genblk3_SRAMADDR[2]}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.090039  -input_transition_fall 0.094211  [get_ports {u_ahb_ram_genblk3_SRAMADDR[2]}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.090039  -input_transition_fall 0.094211  [get_ports {u_ahb_ram_genblk3_SRAMADDR[2]}]
set_input_delay  1.152239 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[1]}]
set_input_delay  0.98358 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[1]}]
set_input_delay  1.225543 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[1]}]
set_input_delay  1.044235 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[1]}]
set_input_delay  2.451164 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[1]}]
set_input_delay  0.6469 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[1]}]
set_input_delay  2.479633 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[1]}]
set_input_delay  0.66754 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[1]}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.15044  -input_transition_fall 0.081765  [get_ports {u_ahb_ram_genblk3_SRAMADDR[1]}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.15044  -input_transition_fall 0.081765  [get_ports {u_ahb_ram_genblk3_SRAMADDR[1]}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.15044  -input_transition_fall 0.081765  [get_ports {u_ahb_ram_genblk3_SRAMADDR[1]}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.15044  -input_transition_fall 0.081765  [get_ports {u_ahb_ram_genblk3_SRAMADDR[1]}]
set_input_delay  1.129125 -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[0]}]
set_input_delay  0.956499 -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[0]}]
set_input_delay  1.240749 -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[0]}]
set_input_delay  1.029278 -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[0]}]
set_input_delay  2.434671 -clock [get_clocks {XTAL1}] -fall -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[0]}]
set_input_delay  0.641586 -clock [get_clocks {XTAL1}] -fall -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[0]}]
set_input_delay  2.4664 -clock [get_clocks {XTAL1}] -rise -max -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[0]}]
set_input_delay  0.660378 -clock [get_clocks {XTAL1}] -rise -min -add_delay -network_latency_included -source_latency_included [get_ports {u_ahb_ram_genblk3_SRAMADDR[0]}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.147581  -input_transition_fall 0.080198  [get_ports {u_ahb_ram_genblk3_SRAMADDR[0]}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.147581  -input_transition_fall 0.080198  [get_ports {u_ahb_ram_genblk3_SRAMADDR[0]}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.147581  -input_transition_fall 0.080198  [get_ports {u_ahb_ram_genblk3_SRAMADDR[0]}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell INVX16BA10TR -from_pin A -pin Y -input_transition_rise 0.147581  -input_transition_fall 0.080198  [get_ports {u_ahb_ram_genblk3_SRAMADDR[0]}]
set_clock_latency -source -rise  -clock [get_clocks {XTAL1}]  0.223071 [get_ports {gated_hclk}]
set_clock_latency -source -fall -late  -clock [get_clocks {XTAL1}]  0.217535 [get_ports {gated_hclk}]
set_clock_latency -source -fall -early  -clock [get_clocks {XTAL1}]  0.217209 [get_ports {gated_hclk}]
set_driving_cell -rise -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell BUFX6BA10TR -from_pin A -pin Y -input_transition_rise 0.056097  -input_transition_fall 0.04891  [get_ports {gated_hclk}]
set_driving_cell -fall -max -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell BUFX6BA10TR -from_pin A -pin Y -input_transition_rise 0.056097  -input_transition_fall 0.04891  [get_ports {gated_hclk}]
set_driving_cell -rise -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell BUFX6BA10TR -from_pin A -pin Y -input_transition_rise 0.056097  -input_transition_fall 0.04794  [get_ports {gated_hclk}]
set_driving_cell -fall -min -library scadv10_cln65gp_rvt_tt_1p0v_25c -lib_cell BUFX6BA10TR -from_pin A -pin Y -input_transition_rise 0.056097  -input_transition_fall 0.04794  [get_ports {gated_hclk}]
set_propagated_clock [get_pins {u_part_extmem1/u_mem_ext1/u_ahb_ram_genblk3_u_fpga_sram_sBRAM2_mem0/CLK}]
###############################################################################
# Extra setting
###############################################################################
set timing_input_port_default_clock false
set auto_wire_load_selection false
set_wire_load_mode top
###############################################################################
# POCV Information
###############################################################################
